adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGA_SYSCTRL_PERIPHERALS_H
#define NRF54H20_ENGA_SYSCTRL_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/* Domain definition */
#define NRF_DOMAIN NRF_DOMAIN_SYSCTRL

/*VPR CSR registers*/
#define VPRCSR_PRESENT 1
#define VPRCSR_COUNT 1

#define VPRCSR_HARTNUM 12                            /*!< HARTNUM: 12                                                          */
#define VPRCSR_MCLICBASERESET 0x5F8C9000             /*!< MCLICBASE: 0x5F8C9000                                                */
#define VPRCSR_MULDIV 1                              /*!< MULDIV: 1                                                            */
#define VPRCSR_HIBERNATE 1                           /*!< HIBERNATE: 1                                                         */
#define VPRCSR_DBG 1                                 /*!< DBG: 1                                                               */
#define VPRCSR_REMAP 1                               /*!< Code patching (REMAP): 1                                             */
#define VPRCSR_BUSWIDTH 64                           /*!< BUSWIDTH: 64                                                         */
#define VPRCSR_BKPT 1                                /*!< BKPT: 1                                                              */
#define VPRCSR_VIOPINS 0x0000000F                    /*!< CSR VIOPINS value: 0x0000000F                                        */
#define VPRCSR_RT_SPLIT_SEC 1                        /*!< RT_SPLIT_SEC: 1                                                      */
#define VPRCSR_RT_SHIFT_PRESENT 0                    /*!< RT_SHIFT_PRESENT: 0                                                  */
#define VPRCSR_RT_SHIFT_START 0                      /*!< RT_SHIFT_START: 0                                                    */
#define VPRCSR_RT_SHIFT_LENGTH 32                    /*!< RT_SHIFT_LENGTH: rt_shift_length                                     */
#define VPRCSR_VEVIF_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPRCSR_VEVIF_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPRCSR_VEVIF_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPRCSR_VEVIF_TASKS_MASK 0xFFFFF0FF           /*!< Mask of supported VEVIF tasks: 0xFFFFF0FF                            */
#define VPRCSR_VEVIF_NDPPI_MIN 24                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPRCSR_VEVIF_NDPPI_MAX 27                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPRCSR_VEVIF_NDPPI_SIZE 28                   /*!< VEVIF DPPI channels: 24..27                                          */
#define VPRCSR_VEVIF_NEVENTS_MIN 28                  /*!< VEVIF events: 28..31                                                 */
#define VPRCSR_VEVIF_NEVENTS_MAX 31                  /*!< VEVIF events: 28..31                                                 */
#define VPRCSR_VEVIF_NEVENTS_SIZE 32                 /*!< VEVIF events: 28..31                                                 */
#define VPRCSR_RST_UNRECOV 0                         /*!< Unrecoverable state forces syncronous reset: 0                       */
#define VPRCSR_BEXT 0                                /*!< Bit-Manipulation extension: 0                                        */
#define VPRCSR_CACHE_EN 0                            /*!< (unspecified)                                                        */
#define VPRCSR_OUTMODE_VPR1_2 0                      /*!< (unspecified)                                                        */
#define VPRCSR_VPR_BUS_PRIO 0                        /*!< (unspecified)                                                        */
#define VPRCSR_NMIMPID_VPR1_3_3 0                    /*!< (unspecified)                                                        */

/*One time programmable Information Configuration Registers*/
#define OICR_PRESENT 1
#define OICR_COUNT 1

/*CACHEDATA*/
#define CACHEDATA_PRESENT 1
#define CACHEDATA_COUNT 1

/*CACHEINFO*/
#define CACHEINFO_PRESENT 1
#define CACHEINFO_COUNT 1

/*CRACENCORE*/
#define CRACENCORE_PRESENT 1
#define CRACENCORE_COUNT 1

#define SHA3CORE_CRYPTMSTRDMAREGS 1                  /*!< (unspecified)                                                        */
#define SHA3CORE_CRYPTMSTRHWREGS 1                   /*!< (unspecified)                                                        */
#define SHA3CORE_RNGCONTROLREGS 0                    /*!< (unspecified)                                                        */
#define SHA3CORE_PKREGS 0                            /*!< (unspecified)                                                        */
#define SHA3CORE_IKGREGS 0                           /*!< (unspecified)                                                        */
#define SHA3CORE_RNGDATAREGS 0                       /*!< (unspecified)                                                        */
#define SHA3CORE_PKDATAMEMORYREGS 0                  /*!< (unspecified)                                                        */
#define SHA3CORE_PKUCODEREGS 0                       /*!< (unspecified)                                                        */
#define SHA3CORE_CRACENRESETVALUES 0                 /*!< (unspecified)                                                        */
#define SHA3CORE_SHA3RESETVALUES 0                   /*!< (unspecified)                                                        */

