adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 3

#define HSFLL200_DITHER_32B 0                        /*!< (unspecified)                                                        */
#define HSFLL200_CLOCKCTRL_MULT_RESET 6              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */

#define HSFLL121_DITHER_32B 0                        /*!< (unspecified)                                                        */
#define HSFLL121_CLOCKCTRL_MULT_RESET 6              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */

#define HSFLL120_DITHER_32B 0                        /*!< (unspecified)                                                        */
#define HSFLL120_CLOCKCTRL_MULT_RESET 6              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 3

#define LRCCONF200_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF200_RETAIN 0                          /*!< (unspecified)                                                        */
#define LRCCONF200_SYSTEMOFF 0                       /*!< (unspecified)                                                        */
#define LRCCONF200_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF200_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF200_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF200_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF200_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF200_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF200_NACTPD_MAX 7                      /*!< (unspecified)                                                        */
#define LRCCONF200_NACTPD_SIZE 8                     /*!< (unspecified)                                                        */
#define LRCCONF200_PDACT 0                           /*!< (unspecified)                                                        */
#define LRCCONF200_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF200_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF200_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF200_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF200_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF200_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF200_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF200_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF200_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF200_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF200_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF200_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF120_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF120_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF120_SYSTEMOFF 0                       /*!< (unspecified)                                                        */
#define LRCCONF120_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF120_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF120_NCLK_MAX 1                        /*!< (unspecified)                                                        */
#define LRCCONF120_NCLK_SIZE 2                       /*!< (unspecified)                                                        */
#define LRCCONF120_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF120_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF120_NACTPD_MAX 1                      /*!< (unspecified)                                                        */
#define LRCCONF120_NACTPD_SIZE 2                     /*!< (unspecified)                                                        */
#define LRCCONF120_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF120_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF120_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF120_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF120_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF120_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF120_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF120_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF120_AX2XWAITSTATES 1                  /*!< (unspecified)                                                        */
#define LRCCONF120_POWERON_MAIN_RESET 1              /*!< Reset value of register POWERON.MAIN: 1                              */
#define LRCCONF120_POWERON_ACT_RESET 1               /*!< Reset value of register POWERON.ACT: 1                               */
#define LRCCONF120_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF120_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

