adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define LRCCONF130_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF130_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF130_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MAX 7                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_SIZE 8                       /*!< (unspecified)                                                        */
#define LRCCONF130_CLKCTRL 0                         /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF130_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MAX 10                        /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_SIZE 11                       /*!< (unspecified)                                                        */
#define LRCCONF130_OTHERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF130_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF130_POWERON_MAIN_RESET 1              /*!< Reset value of register POWERON.MAIN: 1                              */
#define LRCCONF130_POWERON_ACT_RESET 1               /*!< Reset value of register POWERON.ACT: 1                               */
#define LRCCONF130_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF130_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

/*VPR CLIC registers*/
#define CLIC_PRESENT 1
#define CLIC_COUNT 1

#define VPRCLIC_IRQ_COUNT 32
#define VPRCLIC_IRQNUM_MIN 0                         /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_MAX 479                       /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_SIZE 480                      /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_CLIC_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_TASKS_MASK 0xFFFFF0FF           /*!< Mask of supported VEVIF tasks: 0xFFFFF0FF                            */
#define VPRCLIC_COUNTER_IRQ_NUM 32                   /*!< VPR counter (CNT0) interrupt handler number (COUNTER_IRQ_NUM): 32    */
#define VPRCLIC_CLIC_VPR_1_2 0                       /*!< (unspecified)                                                        */

/*VTIM CSR registers*/
#define VTIM_PRESENT 1
#define VTIM_COUNT 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 1

#define L2CACHE_VIRTUALCACHE 1                       /*!< (unspecified)                                                        */
#define L2CACHE_FLUSH 0                              /*!< (unspecified)                                                        */
#define L2CACHE_CLEAN 0                              /*!< (unspecified)                                                        */

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 6

#define RAMC110_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC110_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC111_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC111_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC120_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC120_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC121_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC121_SEC 0                                /*!< (unspecified)                                                        */

