adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define RAMC130_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC130_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC131_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC131_SEC 0                                /*!< (unspecified)                                                        */

/*CRACEN*/
#define CRACEN_PRESENT 1
#define CRACEN_COUNT 1

#define SHA3_CRYPTOACCELERATOR 0                     /*!< (unspecified)                                                        */

/*PCGCSlave*/
#define PCGCSLAVE_PRESENT 1
#define PCGCSLAVE_COUNT 13

#define PCGCS110_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS120_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS121_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS122_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS130_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS131_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS132_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS133_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS134_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS135_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS136_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS137_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS138_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

/*PCGC Master*/
#define PCGCMASTER_PRESENT 1
#define PCGCMASTER_COUNT 12

#define PCGCM110_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM110_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM110_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM110_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM120_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM120_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM120_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM120_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM121_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM121_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM121_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM121_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM130_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM130_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM130_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM130_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM131_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM131_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM131_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM131_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM132_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM132_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM132_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM132_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM133_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM133_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM133_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM133_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM134_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM134_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM134_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM134_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM135_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM135_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM135_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM135_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM136_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM136_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM136_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM136_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM137_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM137_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM137_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM137_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM138_POWERCONSUMPTIONCALC 1              /*!< (unspecified)                                                        */
#define PCGCM138_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM138_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM138_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

/*EXternal Memory Encryption Engine*/
#define EXMEE_PRESENT 1
#define EXMEE_COUNT 1

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

