adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define MVDMA_PRESENT 1
#define MVDMA_COUNT 1

/*PPIB APB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 11

/*ROM Controller*/
#define ROMC_PRESENT 1
#define ROMC_COUNT 1

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 2

#define MEMCONF120_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF120_REPAIR 1                          /*!< (unspecified)                                                        */
#define MEMCONF120_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF120_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF120_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF120_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF120_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF120_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

#define MEMCONF130_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF130_REPAIR 1                          /*!< (unspecified)                                                        */
#define MEMCONF130_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF130_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF130_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF130_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF130_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF130_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 3

/*GRCCONF*/
#define GRCCONF_PRESENT 1
#define GRCCONF_COUNT 1

/*PCRM*/
#define PCRM_PRESENT 1
#define PCRM_COUNT 1

/*CLOCK*/
#define CLOCK_PRESENT 1
#define CLOCK_COUNT 1

/*LFRC peripheral*/
#define LFRC_PRESENT 1
#define LFRC_COUNT 1

/*GENERIC*/
#define GENERIC_PRESENT 1
#define GENERIC_COUNT 1

/*LFXO peripheral*/
#define LFXO_PRESENT 1
#define LFXO_COUNT 1

/*FLL16M*/
#define FLL16M_PRESENT 1
#define FLL16M_COUNT 1

/*HFXO peripheral*/
#define HFXO_PRESENT 1
#define HFXO_COUNT 1

/*AUXPLL*/
#define AUXPLL_PRESENT 1
#define AUXPLL_COUNT 3

/*POWER*/
#define POWER_PRESENT 1
#define POWER_COUNT 1

#define POWER_NABBDOMAIN_MIN 0                       /*!< Number of ABB domains: 0..1                                          */
#define POWER_NABBDOMAIN_MAX 1                       /*!< Number of ABB domains: 0..1                                          */
#define POWER_NABBDOMAIN_SIZE 2                      /*!< Number of ABB domains: 0..1                                          */
#define POWER_NATBGNDCLAMP_MIN 0                     /*!< Number of ATB ground clamps: 0..13                                   */
#define POWER_NATBGNDCLAMP_MAX 13                    /*!< Number of ATB ground clamps: 0..13                                   */
#define POWER_NATBGNDCLAMP_SIZE 14                   /*!< Number of ATB ground clamps: 0..13                                   */
#define POWER_pmicenable 0                           /*!< (unspecified)                                                        */

/*VREGMAIN peripheral*/
#define VREGMAIN_PRESENT 1
#define VREGMAIN_COUNT 1

/*VREGAO1V8 peripheral*/
#define VREGAO1V8_PRESENT 1
#define VREGAO1V8_COUNT 1

/*VREG1V0*/
#define VREG1V0_PRESENT 1
#define VREG1V0_COUNT 1

/*VREGAO0V8 peripheral*/
#define VREGAO0V8_PRESENT 1
#define VREGAO0V8_COUNT 1

/*VREGVS0V8 peripheral*/
#define VREGVS0V8_PRESENT 1
#define VREGVS0V8_COUNT 1

/*VREGSU peripheral*/
#define VREGSU_PRESENT 1
#define VREGSU_COUNT 1

/*VREGUSB peripheral*/
#define VREGUSB_PRESENT 1
#define VREGUSB_COUNT 1

/*AUXPM*/
#define AUXPM_PRESENT 1
#define AUXPM_COUNT 2

/*VREGMRAM peripheral*/
#define VREGMRAM_PRESENT 1
#define VREGMRAM_COUNT 2

/*OSCRFR peripheral*/
#define OSCRFR_PRESENT 1
#define OSCRFR_COUNT 1

/*SWEXT peripheral*/
#define SWEXT_PRESENT 1
#define SWEXT_COUNT 1

/*MBIAS peripheral*/
#define MBIAS_PRESENT 1
#define MBIAS_COUNT 1

/*VDETAO1V8 peripheral*/
#define VDETAO1V8_PRESENT 1
#define VDETAO1V8_COUNT 1

/*VDETAO0V8 peripheral*/
#define VDETAO0V8_PRESENT 1
#define VDETAO0V8_COUNT 1

/*VDETVS0V8 peripheral*/
#define VDETVS0V8_PRESENT 1
#define VDETVS0V8_COUNT 1

/*VDETIO peripheral*/
#define VDETIO_PRESENT 1
#define VDETIO_COUNT 1

/*VDETAO5V0 peripheral*/
#define VDETAO5V0_PRESENT 1
#define VDETAO5V0_COUNT 1

/*VDET1V0 peripheral*/
#define VDET1V0_PRESENT 1
#define VDET1V0_COUNT 1

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

#define FICR_LTE_ON 0                                /*!< (unspecified)                                                        */
#define FICR_WIFI_ON 0                               /*!< (unspecified)                                                        */
#define FICR_NFC_ON 1                                /*!< (unspecified)                                                        */

/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT 1
#define I3CCORE_COUNT 2

/*DMU*/
#define DMU_PRESENT 1
#define DMU_COUNT 1

/*MCAN*/
#define MCAN_PRESENT 1
#define MCAN_COUNT 1

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT 1
#define STMDATA_COUNT 1

