adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define UARTE135_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE135_EASYDMA_MAXCNT_SIZE_MAX 14          /*!< (unspecified)                                                        */
#define UARTE135_EASYDMA_MAXCNT_SIZE_SIZE 15         /*!< (unspecified)                                                        */
#define UARTE135_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE135_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE135_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE135_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE135_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE136_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE136_EASYDMA_MAXCNT_SIZE_MAX 14          /*!< (unspecified)                                                        */
#define UARTE136_EASYDMA_MAXCNT_SIZE_SIZE 15         /*!< (unspecified)                                                        */
#define UARTE136_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE136_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE136_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE136_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE136_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE137_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE137_EASYDMA_MAXCNT_SIZE_MAX 14          /*!< (unspecified)                                                        */
#define UARTE137_EASYDMA_MAXCNT_SIZE_SIZE 15         /*!< (unspecified)                                                        */
#define UARTE137_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE137_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE137_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE137_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE137_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

/*Serial Peripheral Interface Master with EasyDMA*/
#define SPIM_PRESENT 1
#define SPIM_COUNT 10

#define SPIM120_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define SPIM120_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define SPIM120_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM120_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM120_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIM120_HSSPI 1                              /*!< (unspecified)                                                        */

#define SPIM121_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define SPIM121_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define SPIM121_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM121_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM121_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIM121_HSSPI 1                              /*!< (unspecified)                                                        */

#define SPIM130_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define SPIM130_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define SPIM130_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM130_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM130_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIM130_HSSPI 1                              /*!< (unspecified)                                                        */

#define SPIM131_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define SPIM131_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define SPIM131_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM131_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM131_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIM131_HSSPI 1                              /*!< (unspecified)                                                        */

#define SPIM132_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define SPIM132_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define SPIM132_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM132_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIM132_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIM132_HSSPI 1                              /*!< (unspecified)                                                        */

