adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define I2S130_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define I2S130_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define I2S130_EASYDMA_MAXCNT_SIZE_MIN 0             /*!< (unspecified)                                                        */
#define I2S130_EASYDMA_MAXCNT_SIZE_MAX 13            /*!< (unspecified)                                                        */
#define I2S130_EASYDMA_MAXCNT_SIZE_SIZE 14           /*!< (unspecified)                                                        */

#define I2S131_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define I2S131_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define I2S131_EASYDMA_MAXCNT_SIZE_MIN 0             /*!< (unspecified)                                                        */
#define I2S131_EASYDMA_MAXCNT_SIZE_MAX 13            /*!< (unspecified)                                                        */
#define I2S131_EASYDMA_MAXCNT_SIZE_SIZE 14           /*!< (unspecified)                                                        */

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT 1
#define PDM_COUNT 1

#define PDM_EASYDMA5 0                               /*!< (unspecified)                                                        */
#define PDM_EASYDMATEMP 1                            /*!< (unspecified)                                                        */
#define PDM_EASYDMALISTINCLUDED 0                    /*!< (unspecified)                                                        */
#define PDM_EASYDMAMODEINCLUDED 0                    /*!< (unspecified)                                                        */
#define PDM_EASYDMAFULLLPMODEINCLUDED 0              /*!< (unspecified)                                                        */

/*Quadrature Decoder*/
#define QDEC_PRESENT 1
#define QDEC_COUNT 2

#define QDEC130_LEGACYPSEL 0                         /*!< (unspecified)                                                        */

#define QDEC131_LEGACYPSEL 0                         /*!< (unspecified)                                                        */

/*SIM card interface*/
#define SIMIF_PRESENT 1
#define SIMIF_COUNT 1

/*I2C compatible Two-Wire Master Interface with EasyDMA*/
#define TWIM_PRESENT 1
#define TWIM_COUNT 8

#define TWIM130_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM130_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM130_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM130_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM130_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM131_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM131_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM131_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM131_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM131_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM132_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM132_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM132_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM132_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM132_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM133_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM133_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM133_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM133_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM133_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM134_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM134_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM134_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM134_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM134_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM135_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM135_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM135_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM135_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM135_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM136_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM136_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM136_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM136_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM136_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIM137_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIM137_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIM137_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM137_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM137_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT 1
#define TWIS_COUNT 8

