adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl_peripherals.h
#define TWIS130_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS130_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS130_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS130_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS130_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS131_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS131_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS131_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS131_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS131_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS132_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS132_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS132_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS132_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS132_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS133_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS133_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS133_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS134_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS134_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS134_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS135_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS135_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS135_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS136_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS136_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS136_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */

#define TWIS137_EASYDMA5 0                           /*!< (unspecified)                                                        */
#define TWIS137_EASYDMATEMP 1                        /*!< (unspecified)                                                        */
#define TWIS137_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGA_SYSCTRL_PERIPHERALS_H */

